TexasInstruments/f29h85x-sdk/source/driverlib/inc/hw_epwm_xbar.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the PWMXBARG6SEL register
//
//*************************************************************************************************
#define EPWM_XBAR_PWMXBARG6SEL_INPUT0    0x1U          // Select bit for INPUT0
#define EPWM_XBAR_PWMXBARG6SEL_INPUT1    0x2U          // Select bit for INPUT1
#define EPWM_XBAR_PWMXBARG6SEL_INPUT2    0x4U          // Select bit for INPUT2
#define EPWM_XBAR_PWMXBARG6SEL_INPUT3    0x8U          // Select bit for INPUT3
#define EPWM_XBAR_PWMXBARG6SEL_INPUT4    0x10U         // Select bit for INPUT4
#define EPWM_XBAR_PWMXBARG6SEL_INPUT5    0x20U         // Select bit for INPUT5
#define EPWM_XBAR_PWMXBARG6SEL_INPUT6    0x40U         // Select bit for INPUT6
#define EPWM_XBAR_PWMXBARG6SEL_INPUT7    0x80U         // Select bit for INPUT7
#define EPWM_XBAR_PWMXBARG6SEL_INPUT8    0x100U        // Select bit for INPUT8
#define EPWM_XBAR_PWMXBARG6SEL_INPUT9    0x200U        // Select bit for INPUT9
#define EPWM_XBAR_PWMXBARG6SEL_INPUT10   0x400U        // Select bit for INPUT10
#define EPWM_XBAR_PWMXBARG6SEL_INPUT11   0x800U        // Select bit for INPUT11
#define EPWM_XBAR_PWMXBARG6SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define EPWM_XBAR_PWMXBARG6SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define EPWM_XBAR_PWMXBARG6SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define EPWM_XBAR_PWMXBARG6SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define EPWM_XBAR_PWMXBARG6SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define EPWM_XBAR_PWMXBARG6SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define EPWM_XBAR_PWMXBARG6SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define EPWM_XBAR_PWMXBARG6SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define EPWM_XBAR_PWMXBARG6SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define EPWM_XBAR_PWMXBARG6SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define EPWM_XBAR_PWMXBARG6SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define EPWM_XBAR_PWMXBARG6SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define EPWM_XBAR_PWMXBARG6SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define EPWM_XBAR_PWMXBARG6SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define EPWM_XBAR_PWMXBARG6SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define EPWM_XBAR_PWMXBARG6SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define EPWM_XBAR_PWMXBARG6SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define EPWM_XBAR_PWMXBARG6SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define EPWM_XBAR_PWMXBARG6SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define EPWM_XBAR_PWMXBARG6SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the PWMXBARG7SEL register
//
//*************************************************************************************************
#define EPWM_XBAR_PWMXBARG7SEL_INPUT0    0x1U          // Select bit for INPUT0
#define EPWM_XBAR_PWMXBARG7SEL_INPUT1    0x2U          // Select bit for INPUT1
#define EPWM_XBAR_PWMXBARG7SEL_INPUT2    0x4U          // Select bit for INPUT2
#define EPWM_XBAR_PWMXBARG7SEL_INPUT3    0x8U          // Select bit for INPUT3
#define EPWM_XBAR_PWMXBARG7SEL_INPUT4    0x10U         // Select bit for INPUT4
#define EPWM_XBAR_PWMXBARG7SEL_INPUT5    0x20U         // Select bit for INPUT5
#define EPWM_XBAR_PWMXBARG7SEL_INPUT6    0x40U         // Select bit for INPUT6
#define EPWM_XBAR_PWMXBARG7SEL_INPUT7    0x80U         // Select bit for INPUT7
#define EPWM_XBAR_PWMXBARG7SEL_INPUT8    0x100U        // Select bit for INPUT8
#define EPWM_XBAR_PWMXBARG7SEL_INPUT9    0x200U        // Select bit for INPUT9
#define EPWM_XBAR_PWMXBARG7SEL_INPUT10   0x400U        // Select bit for INPUT10
#define EPWM_XBAR_PWMXBARG7SEL_INPUT11   0x800U        // Select bit for INPUT11
#define EPWM_XBAR_PWMXBARG7SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define EPWM_XBAR_PWMXBARG7SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define EPWM_XBAR_PWMXBARG7SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define EPWM_XBAR_PWMXBARG7SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define EPWM_XBAR_PWMXBARG7SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define EPWM_XBAR_PWMXBARG7SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define EPWM_XBAR_PWMXBARG7SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define EPWM_XBAR_PWMXBARG7SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define EPWM_XBAR_PWMXBARG7SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define EPWM_XBAR_PWMXBARG7SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define EPWM_XBAR_PWMXBARG7SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define EPWM_XBAR_PWMXBARG7SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define EPWM_XBAR_PWMXBARG7SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define EPWM_XBAR_PWMXBARG7SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define EPWM_XBAR_PWMXBARG7SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define EPWM_XBAR_PWMXBARG7SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define EPWM_XBAR_PWMXBARG7SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define EPWM_XBAR_PWMXBARG7SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define EPWM_XBAR_PWMXBARG7SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define EPWM_XBAR_PWMXBARG7SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the PWMXBARG8SEL register
//
//*************************************************************************************************
#define EPWM_XBAR_PWMXBARG8SEL_INPUT0    0x1U          // Select bit for INPUT0
#define EPWM_XBAR_PWMXBARG8SEL_INPUT1    0x2U          // Select bit for INPUT1
#define EPWM_XBAR_PWMXBARG8SEL_INPUT2    0x4U          // Select bit for INPUT2
#define EPWM_XBAR_PWMXBARG8SEL_INPUT3    0x8U          // Select bit for INPUT3
#define EPWM_XBAR_PWMXBARG8SEL_INPUT4    0x10U         // Select bit for INPUT4
#define EPWM_XBAR_PWMXBARG8SEL_INPUT5    0x20U         // Select bit for INPUT5
#define EPWM_XBAR_PWMXBARG8SEL_INPUT6    0x40U         // Select bit for INPUT6
#define EPWM_XBAR_PWMXBARG8SEL_INPUT7    0x80U         // Select bit for INPUT7
#define EPWM_XBAR_PWMXBARG8SEL_INPUT8    0x100U        // Select bit for INPUT8
#define EPWM_XBAR_PWMXBARG8SEL_INPUT9    0x200U        // Select bit for INPUT9
#define EPWM_XBAR_PWMXBARG8SEL_INPUT10   0x400U        // Select bit for INPUT10
#define EPWM_XBAR_PWMXBARG8SEL_INPUT11   0x800U        // Select bit for INPUT11
#define EPWM_XBAR_PWMXBARG8SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define EPWM_XBAR_PWMXBARG8SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define EPWM_XBAR_PWMXBARG8SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define EPWM_XBAR_PWMXBARG8SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define EPWM_XBAR_PWMXBARG8SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define EPWM_XBAR_PWMXBARG8SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define EPWM_XBAR_PWMXBARG8SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define EPWM_XBAR_PWMXBARG8SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define EPWM_XBAR_PWMXBARG8SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define EPWM_XBAR_PWMXBARG8SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define EPWM_XBAR_PWMXBARG8SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define EPWM_XBAR_PWMXBARG8SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define EPWM_XBAR_PWMXBARG8SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define EPWM_XBAR_PWMXBARG8SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define EPWM_XBAR_PWMXBARG8SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define EPWM_XBAR_PWMXBARG8SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define EPWM_XBAR_PWMXBARG8SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define EPWM_XBAR_PWMXBARG8SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define EPWM_XBAR_PWMXBARG8SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define EPWM_XBAR_PWMXBARG8SEL_INPUT31   0x80000000U   // Select bit for INPUT31

//*************************************************************************************************
//
// The following are defines for the bit fields in the PWMXBARG9SEL register
//
//*************************************************************************************************
#define EPWM_XBAR_PWMXBARG9SEL_INPUT0    0x1U          // Select bit for INPUT0
#define EPWM_XBAR_PWMXBARG9SEL_INPUT1    0x2U          // Select bit for INPUT1
#define EPWM_XBAR_PWMXBARG9SEL_INPUT2    0x4U          // Select bit for INPUT2
#define EPWM_XBAR_PWMXBARG9SEL_INPUT3    0x8U          // Select bit for INPUT3
#define EPWM_XBAR_PWMXBARG9SEL_INPUT4    0x10U         // Select bit for INPUT4
#define EPWM_XBAR_PWMXBARG9SEL_INPUT5    0x20U         // Select bit for INPUT5
#define EPWM_XBAR_PWMXBARG9SEL_INPUT6    0x40U         // Select bit for INPUT6
#define EPWM_XBAR_PWMXBARG9SEL_INPUT7    0x80U         // Select bit for INPUT7
#define EPWM_XBAR_PWMXBARG9SEL_INPUT8    0x100U        // Select bit for INPUT8
#define EPWM_XBAR_PWMXBARG9SEL_INPUT9    0x200U        // Select bit for INPUT9
#define EPWM_XBAR_PWMXBARG9SEL_INPUT10   0x400U        // Select bit for INPUT10
#define EPWM_XBAR_PWMXBARG9SEL_INPUT11   0x800U        // Select bit for INPUT11
#define EPWM_XBAR_PWMXBARG9SEL_INPUT12   0x1000U       // Select bit for INPUT12
#define EPWM_XBAR_PWMXBARG9SEL_INPUT13   0x2000U       // Select bit for INPUT13
#define EPWM_XBAR_PWMXBARG9SEL_INPUT14   0x4000U       // Select bit for INPUT14
#define EPWM_XBAR_PWMXBARG9SEL_INPUT15   0x8000U       // Select bit for INPUT15
#define EPWM_XBAR_PWMXBARG9SEL_INPUT16   0x10000U      // Select bit for INPUT16
#define EPWM_XBAR_PWMXBARG9SEL_INPUT17   0x20000U      // Select bit for INPUT17
#define EPWM_XBAR_PWMXBARG9SEL_INPUT18   0x40000U      // Select bit for INPUT18
#define EPWM_XBAR_PWMXBARG9SEL_INPUT19   0x80000U      // Select bit for INPUT19
#define EPWM_XBAR_PWMXBARG9SEL_INPUT20   0x100000U     // Select bit for INPUT20
#define EPWM_XBAR_PWMXBARG9SEL_INPUT21   0x200000U     // Select bit for INPUT21
#define EPWM_XBAR_PWMXBARG9SEL_INPUT22   0x400000U     // Select bit for INPUT22
#define EPWM_XBAR_PWMXBARG9SEL_INPUT23   0x800000U     // Select bit for INPUT23
#define EPWM_XBAR_PWMXBARG9SEL_INPUT24   0x1000000U    // Select bit for INPUT24
#define EPWM_XBAR_PWMXBARG9SEL_INPUT25   0x2000000U    // Select bit for INPUT25
#define EPWM_XBAR_PWMXBARG9SEL_INPUT26   0x4000000U    // Select bit for INPUT26
#define EPWM_XBAR_PWMXBARG9SEL_INPUT27   0x8000000U    // Select bit for INPUT27
#define EPWM_XBAR_PWMXBARG9SEL_INPUT28   0x10000000U   // Select bit for INPUT28
#define EPWM_XBAR_PWMXBARG9SEL_INPUT29   0x20000000U   // Select bit for INPUT29
#define EPWM_XBAR_PWMXBARG9SEL_INPUT30   0x40000000U   // Select bit for INPUT30
#define EPWM_XBAR_PWMXBARG9SEL_INPUT31   0x80000000U   // Select bit for INPUT31



#endif
